---
kind: property
id: P:Autodesk.Revit.DB.ImageBackgroundSettings.BackgroundImageFit
source: html/6ed12672-d553-968c-2399-2ff9496b0491.htm
---
# Autodesk.Revit.DB.ImageBackgroundSettings.BackgroundImageFit Property

The background image fit type.

## Syntax (C#)
```csharp
public BackgroundImageFit BackgroundImageFit { get; set; }
```

## Remarks
This value indicates how scale should be applied to the image in order to fit it to a page or screen.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration